experiments/raw-data/envA-medium-20260505-193811/k6-output.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: /scripts/medium.js
        output: Prometheus remote write (http://prometheus:9090/api/v1/write)

     scenarios: (100.00%) 1 scenario, 30 max VUs, 5m0s max duration (incl. graceful stop):
              * default: Up to 30 looping VUs for 4m30s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/30 VUs, 4 complete and 0 interrupted iterations
default   [   0% ] 01/30 VUs  0m01.0s/4m30.0s

running (0m02.0s), 01/30 VUs, 9 complete and 0 interrupted iterations
default   [   1% ] 01/30 VUs  0m02.0s/4m30.0s

running (0m03.0s), 02/30 VUs, 16 complete and 0 interrupted iterations
default   [   1% ] 02/30 VUs  0m03.0s/4m30.0s

running (0m04.0s), 02/30 VUs, 24 complete and 0 interrupted iterations
default   [   1% ] 02/30 VUs  0m04.0s/4m30.0s

running (0m05.0s), 03/30 VUs, 25 complete and 0 interrupted iterations
default   [   2% ] 03/30 VUs  0m05.0s/4m30.0s

running (0m06.0s), 03/30 VUs, 25 complete and 0 interrupted iterations
default   [   2% ] 03/30 VUs  0m06.0s/4m30.0s

running (0m07.0s), 04/30 VUs, 33 complete and 0 interrupted iterations
default   [   3% ] 04/30 VUs  0m07.0s/4m30.0s

running (0m08.0s), 04/30 VUs, 45 complete and 0 interrupted iterations
default   [   3% ] 04/30 VUs  0m08.0s/4m30.0s

running (0m09.0s), 05/30 VUs, 60 complete and 0 interrupted iterations
default   [   3% ] 05/30 VUs  0m09.0s/4m30.0s

running (0m10.0s), 05/30 VUs, 82 complete and 0 interrupted iterations
default   [   4% ] 05/30 VUs  0m10.0s/4m30.0s

running (0m11.0s), 06/30 VUs, 97 complete and 0 interrupted iterations
default   [   4% ] 06/30 VUs  0m11.0s/4m30.0s

running (0m12.0s), 06/30 VUs, 97 complete and 0 interrupted iterations
default   [   4% ] 06/30 VUs  0m12.0s/4m30.0s

running (0m13.0s), 07/30 VUs, 118 complete and 0 interrupted iterations
default   [   5% ] 07/30 VUs  0m13.0s/4m30.0s

running (0m14.0s), 07/30 VUs, 145 complete and 0 interrupted iterations
default   [   5% ] 07/30 VUs  0m14.0s/4m30.0s

running (0m15.0s), 08/30 VUs, 170 complete and 0 interrupted iterations
default   [   6% ] 08/30 VUs  0m15.0s/4m30.0s

running (0m16.0s), 08/30 VUs, 173 complete and 0 interrupted iterations
default   [   6% ] 08/30 VUs  0m16.0s/4m30.0s

running (0m17.0s), 09/30 VUs, 184 complete and 0 interrupted iterations
default   [   6% ] 09/30 VUs  0m17.0s/4m30.0s

running (0m18.0s), 09/30 VUs, 213 complete and 0 interrupted iterations
default   [   7% ] 09/30 VUs  0m18.0s/4m30.0s

running (0m19.0s), 10/30 VUs, 249 complete and 0 interrupted iterations
default   [   7% ] 10/30 VUs  0m19.0s/4m30.0s

running (0m20.0s), 10/30 VUs, 277 complete and 0 interrupted iterations
default   [   7% ] 10/30 VUs  0m20.0s/4m30.0s

running (0m21.0s), 11/30 VUs, 295 complete and 0 interrupted iterations
default   [   8% ] 11/30 VUs  0m21.0s/4m30.0s

running (0m22.0s), 11/30 VUs, 311 complete and 0 interrupted iterations
default   [   8% ] 11/30 VUs  0m22.0s/4m30.0s

running (0m23.0s), 12/30 VUs, 312 complete and 0 interrupted iterations
default   [   9% ] 12/30 VUs  0m23.0s/4m30.0s

running (0m24.0s), 12/30 VUs, 323 complete and 0 interrupted iterations
default   [   9% ] 12/30 VUs  0m24.0s/4m30.0s

running (0m25.0s), 13/30 VUs, 366 complete and 0 interrupted iterations
default   [   9% ] 13/30 VUs  0m25.0s/4m30.0s

running (0m26.0s), 13/30 VUs, 400 complete and 0 interrupted iterations
default   [  10% ] 13/30 VUs  0m26.0s/4m30.0s

running (0m27.0s), 14/30 VUs, 403 complete and 0 interrupted iterations
default   [  10% ] 14/30 VUs  0m27.0s/4m30.0s

running (0m28.0s), 14/30 VUs, 451 complete and 0 interrupted iterations
default   [  10% ] 14/30 VUs  0m28.0s/4m30.0s

running (0m29.0s), 15/30 VUs, 481 complete and 0 interrupted iterations
default   [  11% ] 15/30 VUs  0m29.0s/4m30.0s

running (0m30.0s), 15/30 VUs, 481 complete and 0 interrupted iterations
default   [  11% ] 15/30 VUs  0m30.0s/4m30.0s

running (0m31.0s), 15/30 VUs, 483 complete and 0 interrupted iterations
default   [  11% ] 15/30 VUs  0m31.0s/4m30.0s

running (0m32.0s), 16/30 VUs, 523 complete and 0 interrupted iterations
default   [  12% ] 16/30 VUs  0m32.0s/4m30.0s

running (0m33.0s), 16/30 VUs, 550 complete and 0 interrupted iterations
default   [  12% ] 16/30 VUs  0m33.0s/4m30.0s

running (0m34.0s), 17/30 VUs, 589 complete and 0 interrupted iterations
default   [  13% ] 17/30 VUs  0m34.0s/4m30.0s

running (0m35.0s), 17/30 VUs, 627 complete and 0 interrupted iterations
default   [  13% ] 17/30 VUs  0m35.0s/4m30.0s

running (0m36.0s), 18/30 VUs, 660 complete and 0 interrupted iterations
default   [  13% ] 18/30 VUs  0m36.0s/4m30.0s

running (0m37.0s), 18/30 VUs, 717 complete and 0 interrupted iterations
default   [  14% ] 18/30 VUs  0m37.0s/4m30.0s

running (0m38.0s), 19/30 VUs, 754 complete and 0 interrupted iterations
default   [  14% ] 19/30 VUs  0m38.0s/4m30.0s

running (0m39.0s), 19/30 VUs, 794 complete and 0 interrupted iterations
default   [  14% ] 19/30 VUs  0m39.0s/4m30.0s

running (0m40.0s), 20/30 VUs, 828 complete and 0 interrupted iterations
default   [  15% ] 20/30 VUs  0m40.0s/4m30.0s

running (0m41.0s), 20/30 VUs, 860 complete and 0 interrupted iterations
default   [  15% ] 20/30 VUs  0m41.0s/4m30.0s

running (0m42.0s), 21/30 VUs, 922 complete and 0 interrupted iterations
default   [  16% ] 21/30 VUs  0m42.0s/4m30.0s

running (0m43.0s), 21/30 VUs, 925 complete and 0 interrupted iterations
default   [  16% ] 21/30 VUs  0m43.0s/4m30.0s

running (0m44.0s), 22/30 VUs, 925 complete and 0 interrupted iterations
default   [  16% ] 22/30 VUs  0m44.0s/4m30.0s

running (0m45.0s), 22/30 VUs, 957 complete and 0 interrupted iterations
default   [  17% ] 22/30 VUs  0m45.0s/4m30.0s

running (0m46.0s), 23/30 VUs, 957 complete and 0 interrupted iterations
default   [  17% ] 23/30 VUs  0m46.0s/4m30.0s

running (0m47.0s), 23/30 VUs, 957 complete and 0 interrupted iterations
default   [  17% ] 23/30 VUs  0m47.0s/4m30.0s

running (0m48.0s), 24/30 VUs, 1003 complete and 0 interrupted iterations
default   [  18% ] 24/30 VUs  0m48.0s/4m30.0s

running (0m49.0s), 24/30 VUs, 1017 complete and 0 interrupted iterations
default   [  18% ] 24/30 VUs  0m49.0s/4m30.0s

running (0m50.0s), 25/30 VUs, 1019 complete and 0 interrupted iterations
default   [  19% ] 25/30 VUs  0m50.0s/4m30.0s

running (0m51.0s), 25/30 VUs, 1048 complete and 0 interrupted iterations
default   [  19% ] 25/30 VUs  0m51.0s/4m30.0s

running (0m52.0s), 26/30 VUs, 1048 complete and 0 interrupted iterations
default   [  19% ] 26/30 VUs  0m52.0s/4m30.0s

running (0m53.0s), 26/30 VUs, 1048 complete and 0 interrupted iterations
default   [  20% ] 26/30 VUs  0m53.0s/4m30.0s

running (0m54.0s), 27/30 VUs, 1090 complete and 0 interrupted iterations
default   [  20% ] 27/30 VUs  0m54.0s/4m30.0s

running (0m55.0s), 27/30 VUs, 1163 complete and 0 interrupted iterations
default   [  20% ] 27/30 VUs  0m55.0s/4m30.0s

running (0m56.0s), 28/30 VUs, 1216 complete and 0 interrupted iterations
default   [  21% ] 28/30 VUs  0m56.0s/4m30.0s

running (0m57.0s), 28/30 VUs, 1232 complete and 0 interrupted iterations
default   [  21% ] 28/30 VUs  0m57.0s/4m30.0s

running (0m58.0s), 29/30 VUs, 1238 complete and 0 interrupted iterations
default   [  21% ] 29/30 VUs  0m58.0s/4m30.0s

running (0m59.0s), 29/30 VUs, 1269 complete and 0 interrupted iterations
default   [  22% ] 29/30 VUs  0m59.0s/4m30.0s

running (1m00.0s), 29/30 VUs, 1294 complete and 0 interrupted iterations
default   [  22% ] 29/30 VUs  1m00.0s/4m30.0s

running (1m01.0s), 30/30 VUs, 1317 complete and 0 interrupted iterations
default   [  23% ] 30/30 VUs  1m01.0s/4m30.0s

running (1m02.0s), 30/30 VUs, 1397 complete and 0 interrupted iterations
default   [  23% ] 30/30 VUs  1m02.0s/4m30.0s

running (1m03.0s), 30/30 VUs, 1443 complete and 0 interrupted iterations
default   [  23% ] 30/30 VUs  1m03.0s/4m30.0s

running (1m04.0s), 30/30 VUs, 1456 complete and 0 interrupted iterations
default   [  24% ] 30/30 VUs  1m04.0s/4m30.0s

running (1m05.0s), 30/30 VUs, 1464 complete and 0 interrupted iterations
default   [  24% ] 30/30 VUs  1m05.0s/4m30.0s

running (1m06.0s), 30/30 VUs, 1476 complete and 0 interrupted iterations
default   [  24% ] 30/30 VUs  1m06.0s/4m30.0s

running (1m07.0s), 30/30 VUs, 1484 complete and 0 interrupted iterations
default   [  25% ] 30/30 VUs  1m07.0s/4m30.0s

running (1m08.0s), 30/30 VUs, 1488 complete and 0 interrupted iterations
default   [  25% ] 30/30 VUs  1m08.0s/4m30.0s

running (1m09.0s), 30/30 VUs, 1529 complete and 0 interrupted iterations
default   [  26% ] 30/30 VUs  1m09.0s/4m30.0s

running (1m10.0s), 30/30 VUs, 1537 complete and 0 interrupted iterations
default   [  26% ] 30/30 VUs  1m10.0s/4m30.0s

running (1m11.0s), 30/30 VUs, 1538 complete and 0 interrupted iterations
default   [  26% ] 30/30 VUs  1m11.0s/4m30.0s

running (1m12.0s), 30/30 VUs, 1565 complete and 0 interrupted iterations
default   [  27% ] 30/30 VUs  1m12.0s/4m30.0s

running (1m13.0s), 30/30 VUs, 1598 complete and 0 interrupted iterations
default   [  27% ] 30/30 VUs  1m13.0s/4m30.0s

running (1m14.0s), 30/30 VUs, 1598 complete and 0 interrupted iterations
default   [  27% ] 30/30 VUs  1m14.0s/4m30.0s

running (1m15.0s), 30/30 VUs, 1607 complete and 0 interrupted iterations
default   [  28% ] 30/30 VUs  1m15.0s/4m30.0s

running (1m16.0s), 30/30 VUs, 1670 complete and 0 interrupted iterations
default   [  28% ] 30/30 VUs  1m16.0s/4m30.0s

running (1m17.0s), 30/30 VUs, 1703 complete and 0 interrupted iterations
default   [  29% ] 30/30 VUs  1m17.0s/4m30.0s

running (1m18.0s), 30/30 VUs, 1709 complete and 0 interrupted iterations
default   [  29% ] 30/30 VUs  1m18.0s/4m30.0s

running (1m19.0s), 30/30 VUs, 1721 complete and 0 interrupted iterations
default   [  29% ] 30/30 VUs  1m19.0s/4m30.0s

running (1m20.0s), 30/30 VUs, 1734 complete and 0 interrupted iterations
default   [  30% ] 30/30 VUs  1m20.0s/4m30.0s

running (1m21.0s), 30/30 VUs, 1758 complete and 0 interrupted iterations
default   [  30% ] 30/30 VUs  1m21.0s/4m30.0s

running (1m22.0s), 30/30 VUs, 1759 complete and 0 interrupted iterations
default   [  30% ] 30/30 VUs  1m22.0s/4m30.0s

running (1m23.0s), 30/30 VUs, 1759 complete and 0 interrupted iterations
default   [  31% ] 30/30 VUs  1m23.0s/4m30.0s

running (1m24.0s), 30/30 VUs, 1788 complete and 0 interrupted iterations
default   [  31% ] 30/30 VUs  1m24.0s/4m30.0s

running (1m25.0s), 30/30 VUs, 1849 complete and 0 interrupted iterations
default   [  31% ] 30/30 VUs  1m25.0s/4m30.0s

running (1m26.0s), 30/30 VUs, 1901 complete and 0 interrupted iterations
default   [  32% ] 30/30 VUs  1m26.0s/4m30.0s

running (1m27.0s), 30/30 VUs, 1931 complete and 0 interrupted iterations
default   [  32% ] 30/30 VUs  1m27.0s/4m30.0s

running (1m28.0s), 30/30 VUs, 1968 complete and 0 interrupted iterations
default   [  33% ] 30/30 VUs  1m28.0s/4m30.0s

running (1m29.0s), 30/30 VUs, 1996 complete and 0 interrupted iterations
default   [  33% ] 30/30 VUs  1m29.0s/4m30.0s

running (1m30.0s), 30/30 VUs, 1999 complete and 0 interrupted iterations
default   [  33% ] 30/30 VUs  1m30.0s/4m30.0s

running (1m31.0s), 30/30 VUs, 2016 complete and 0 interrupted iterations
default   [  34% ] 30/30 VUs  1m31.0s/4m30.0s

running (1m32.0s), 30/30 VUs, 2029 complete and 0 interrupted iterations
default   [  34% ] 30/30 VUs  1m32.0s/4m30.0s

running (1m33.0s), 30/30 VUs, 2031 complete and 0 interrupted iterations
default   [  34% ] 30/30 VUs  1m33.0s/4m30.0s

running (1m34.0s), 30/30 VUs, 2056 complete and 0 interrupted iterations
default   [  35% ] 30/30 VUs  1m34.0s/4m30.0s

running (1m35.0s), 30/30 VUs, 2085 complete and 0 interrupted iterations
default   [  35% ] 30/30 VUs  1m35.0s/4m30.0s

running (1m36.0s), 30/30 VUs, 2088 complete and 0 interrupted iterations
default   [  36% ] 30/30 VUs  1m36.0s/4m30.0s

running (1m37.0s), 30/30 VUs, 2090 complete and 0 interrupted iterations
default   [  36% ] 30/30 VUs  1m37.0s/4m30.0s

running (1m38.0s), 30/30 VUs, 2102 complete and 0 interrupted iterations
default   [  36% ] 30/30 VUs  1m38.0s/4m30.0s

running (1m39.0s), 30/30 VUs, 2126 complete and 0 interrupted iterations
default   [  37% ] 30/30 VUs  1m39.0s/4m30.0s

running (1m40.0s), 30/30 VUs, 2140 complete and 0 interrupted iterations
default   [  37% ] 30/30 VUs  1m40.0s/4m30.0s

running (1m41.0s), 30/30 VUs, 2149 complete and 0 interrupted iterations
default   [  37% ] 30/30 VUs  1m41.0s/4m30.0s

running (1m42.0s), 30/30 VUs, 2170 complete and 0 interrupted iterations
default   [  38% ] 30/30 VUs  1m42.0s/4m30.0s

running (1m43.0s), 30/30 VUs, 2178 complete and 0 interrupted iterations
default   [  38% ] 30/30 VUs  1m43.0s/4m30.0s

running (1m44.0s), 30/30 VUs, 2209 complete and 0 interrupted iterations
default   [  39% ] 30/30 VUs  1m44.0s/4m30.0s

running (1m45.0s), 30/30 VUs, 2264 complete and 0 interrupted iterations
default   [  39% ] 30/30 VUs  1m45.0s/4m30.0s

running (1m46.0s), 30/30 VUs, 2313 complete and 0 interrupted iterations
default   [  39% ] 30/30 VUs  1m46.0s/4m30.0s

running (1m47.0s), 30/30 VUs, 2324 complete and 0 interrupted iterations
default   [  40% ] 30/30 VUs  1m47.0s/4m30.0s

running (1m48.0s), 30/30 VUs, 2336 complete and 0 interrupted iterations
default   [  40% ] 30/30 VUs  1m48.0s/4m30.0s

running (1m49.0s), 30/30 VUs, 2357 complete and 0 interrupted iterations
default   [  40% ] 30/30 VUs  1m49.0s/4m30.0s

running (1m50.0s), 30/30 VUs, 2367 complete and 0 interrupted iterations
default   [  41% ] 30/30 VUs  1m50.0s/4m30.0s

running (1m51.0s), 30/30 VUs, 2370 complete and 0 interrupted iterations
default   [  41% ] 30/30 VUs  1m51.0s/4m30.0s

running (1m52.0s), 30/30 VUs, 2402 complete and 0 interrupted iterations
default   [  41% ] 30/30 VUs  1m52.0s/4m30.0s

running (1m53.0s), 30/30 VUs, 2455 complete and 0 interrupted iterations
default   [  42% ] 30/30 VUs  1m53.0s/4m30.0s

running (1m54.0s), 30/30 VUs, 2489 complete and 0 interrupted iterations
default   [  42% ] 30/30 VUs  1m54.0s/4m30.0s

running (1m55.0s), 30/30 VUs, 2492 complete and 0 interrupted iterations
default   [  43% ] 30/30 VUs  1m55.0s/4m30.0s

running (1m56.0s), 30/30 VUs, 2502 complete and 0 interrupted iterations
default   [  43% ] 30/30 VUs  1m56.0s/4m30.0s

running (1m57.0s), 30/30 VUs, 2525 complete and 0 interrupted iterations
default   [  43% ] 30/30 VUs  1m57.0s/4m30.0s

running (1m58.0s), 30/30 VUs, 2564 complete and 0 interrupted iterations
default   [  44% ] 30/30 VUs  1m58.0s/4m30.0s

running (1m59.0s), 30/30 VUs, 2595 complete and 0 interrupted iterations
default   [  44% ] 30/30 VUs  1m59.0s/4m30.0s

running (2m00.0s), 30/30 VUs, 2595 complete and 0 interrupted iterations
default   [  44% ] 30/30 VUs  2m00.0s/4m30.0s

running (2m01.0s), 30/30 VUs, 2598 complete and 0 interrupted iterations
default   [  45% ] 30/30 VUs  2m01.0s/4m30.0s

running (2m02.0s), 30/30 VUs, 2607 complete and 0 interrupted iterations
default   [  45% ] 30/30 VUs  2m02.0s/4m30.0s

running (2m03.0s), 30/30 VUs, 2607 complete and 0 interrupted iterations
default   [  46% ] 30/30 VUs  2m03.0s/4m30.0s

running (2m04.0s), 30/30 VUs, 2628 complete and 0 interrupted iterations
default   [  46% ] 30/30 VUs  2m04.0s/4m30.0s

running (2m05.0s), 30/30 VUs, 2664 complete and 0 interrupted iterations
default   [  46% ] 30/30 VUs  2m05.0s/4m30.0s

running (2m06.0s), 30/30 VUs, 2689 complete and 0 interrupted iterations
default   [  47% ] 30/30 VUs  2m06.0s/4m30.0s

running (2m07.0s), 30/30 VUs, 2709 complete and 0 interrupted iterations
default   [  47% ] 30/30 VUs  2m07.0s/4m30.0s

running (2m08.0s), 30/30 VUs, 2734 complete and 0 interrupted iterations
default   [  47% ] 30/30 VUs  2m08.0s/4m30.0s

running (2m09.0s), 30/30 VUs, 2779 complete and 0 interrupted iterations
default   [  48% ] 30/30 VUs  2m09.0s/4m30.0s

running (2m10.0s), 30/30 VUs, 2841 complete and 0 interrupted iterations
default   [  48% ] 30/30 VUs  2m10.0s/4m30.0s

running (2m11.0s), 30/30 VUs, 2877 complete and 0 interrupted iterations
default   [  49% ] 30/30 VUs  2m11.0s/4m30.0s

running (2m12.0s), 30/30 VUs, 2877 complete and 0 interrupted iterations
default   [  49% ] 30/30 VUs  2m12.0s/4m30.0s

running (2m13.0s), 30/30 VUs, 2884 complete and 0 interrupted iterations
default   [  49% ] 30/30 VUs  2m13.0s/4m30.0s

running (2m14.0s), 30/30 VUs, 2945 complete and 0 interrupted iterations
default   [  50% ] 30/30 VUs  2m14.0s/4m30.0s

running (2m15.0s), 30/30 VUs, 2962 complete and 0 interrupted iterations
default   [  50% ] 30/30 VUs  2m15.0s/4m30.0s

running (2m16.0s), 30/30 VUs, 2964 complete and 0 interrupted iterations
default   [  50% ] 30/30 VUs  2m16.0s/4m30.0s

running (2m17.0s), 30/30 VUs, 2978 complete and 0 interrupted iterations
default   [  51% ] 30/30 VUs  2m17.0s/4m30.0s

running (2m18.0s), 30/30 VUs, 3012 complete and 0 interrupted iterations
default   [  51% ] 30/30 VUs  2m18.0s/4m30.0s

running (2m19.0s), 30/30 VUs, 3016 complete and 0 interrupted iterations
default   [  51% ] 30/30 VUs  2m19.0s/4m30.0s

running (2m20.0s), 30/30 VUs, 3037 complete and 0 interrupted iterations
default   [  52% ] 30/30 VUs  2m20.0s/4m30.0s

running (2m21.0s), 30/30 VUs, 3085 complete and 0 interrupted iterations
default   [  52% ] 30/30 VUs  2m21.0s/4m30.0s

running (2m22.0s), 30/30 VUs, 3135 complete and 0 interrupted iterations
default   [  53% ] 30/30 VUs  2m22.0s/4m30.0s

running (2m23.0s), 30/30 VUs, 3172 complete and 0 interrupted iterations
default   [  53% ] 30/30 VUs  2m23.0s/4m30.0s

running (2m24.0s), 30/30 VUs, 3199 complete and 0 interrupted iterations
default   [  53% ] 30/30 VUs  2m24.0s/4m30.0s

running (2m25.0s), 30/30 VUs, 3204 complete and 0 interrupted iterations
default   [  54% ] 30/30 VUs  2m25.0s/4m30.0s

running (2m26.0s), 30/30 VUs, 3205 complete and 0 interrupted iterations
default   [  54% ] 30/30 VUs  2m26.0s/4m30.0s

running (2m27.0s), 30/30 VUs, 3235 complete and 0 interrupted iterations
default   [  54% ] 30/30 VUs  2m27.0s/4m30.0s

running (2m28.0s), 30/30 VUs, 3261 complete and 0 interrupted iterations
default   [  55% ] 30/30 VUs  2m28.0s/4m30.0s

running (2m29.0s), 30/30 VUs, 3261 complete and 0 interrupted iterations
default   [  55% ] 30/30 VUs  2m29.0s/4m30.0s

running (2m30.0s), 30/30 VUs, 3286 complete and 0 interrupted iterations
default   [  56% ] 30/30 VUs  2m30.0s/4m30.0s

running (2m31.0s), 30/30 VUs, 3341 complete and 0 interrupted iterations
default   [  56% ] 30/30 VUs  2m31.0s/4m30.0s

running (2m32.0s), 30/30 VUs, 3342 complete and 0 interrupted iterations
default   [  56% ] 30/30 VUs  2m32.0s/4m30.0s

running (2m33.0s), 30/30 VUs, 3342 complete and 0 interrupted iterations
default   [  57% ] 30/30 VUs  2m33.0s/4m30.0s

running (2m34.0s), 30/30 VUs, 3382 complete and 0 interrupted iterations
default   [  57% ] 30/30 VUs  2m34.0s/4m30.0s

running (2m35.0s), 30/30 VUs, 3444 complete and 0 interrupted iterations
default   [  57% ] 30/30 VUs  2m35.0s/4m30.0s

running (2m36.0s), 30/30 VUs, 3459 complete and 0 interrupted iterations
default   [  58% ] 30/30 VUs  2m36.0s/4m30.0s

running (2m37.0s), 30/30 VUs, 3500 complete and 0 interrupted iterations
default   [  58% ] 30/30 VUs  2m37.0s/4m30.0s

running (2m38.0s), 30/30 VUs, 3541 complete and 0 interrupted iterations
default   [  59% ] 30/30 VUs  2m38.0s/4m30.0s

running (2m39.0s), 30/30 VUs, 3559 complete and 0 interrupted iterations
default   [  59% ] 30/30 VUs  2m39.0s/4m30.0s

running (2m40.0s), 30/30 VUs, 3561 complete and 0 interrupted iterations
default   [  59% ] 30/30 VUs  2m40.0s/4m30.0s

running (2m41.0s), 30/30 VUs, 3591 complete and 0 interrupted iterations
default   [  60% ] 30/30 VUs  2m41.0s/4m30.0s

running (2m42.0s), 30/30 VUs, 3598 complete and 0 interrupted iterations
default   [  60% ] 30/30 VUs  2m42.0s/4m30.0s

running (2m43.0s), 30/30 VUs, 3598 complete and 0 interrupted iterations
default   [  60% ] 30/30 VUs  2m43.0s/4m30.0s

running (2m44.0s), 30/30 VUs, 3620 complete and 0 interrupted iterations
default   [  61% ] 30/30 VUs  2m44.0s/4m30.0s

running (2m45.0s), 30/30 VUs, 3677 complete and 0 interrupted iterations
default   [  61% ] 30/30 VUs  2m45.0s/4m30.0s

running (2m46.0s), 30/30 VUs, 3683 complete and 0 interrupted iterations
default   [  61% ] 30/30 VUs  2m46.0s/4m30.0s

running (2m47.0s), 30/30 VUs, 3683 complete and 0 interrupted iterations
default   [  62% ] 30/30 VUs  2m47.0s/4m30.0s

running (2m48.0s), 30/30 VUs, 3698 complete and 0 interrupted iterations
default   [  62% ] 30/30 VUs  2m48.0s/4m30.0s

running (2m49.0s), 30/30 VUs, 3698 complete and 0 interrupted iterations
default   [  63% ] 30/30 VUs  2m49.0s/4m30.0s

running (2m50.0s), 30/30 VUs, 3698 complete and 0 interrupted iterations
default   [  63% ] 30/30 VUs  2m50.0s/4m30.0s

running (2m51.0s), 30/30 VUs, 3749 complete and 0 interrupted iterations
default   [  63% ] 30/30 VUs  2m51.0s/4m30.0s

running (2m52.0s), 30/30 VUs, 3834 complete and 0 interrupted iterations
default   [  64% ] 30/30 VUs  2m52.0s/4m30.0s

running (2m53.0s), 30/30 VUs, 3872 complete and 0 interrupted iterations
default   [  64% ] 30/30 VUs  2m53.0s/4m30.0s

running (2m54.0s), 30/30 VUs, 3872 complete and 0 interrupted iterations
default   [  64% ] 30/30 VUs  2m54.0s/4m30.0s

running (2m55.0s), 30/30 VUs, 3876 complete and 0 interrupted iterations
default   [  65% ] 30/30 VUs  2m55.0s/4m30.0s

running (2m56.0s), 30/30 VUs, 3945 complete and 0 interrupted iterations
default   [  65% ] 30/30 VUs  2m56.0s/4m30.0s

running (2m57.0s), 30/30 VUs, 3973 complete and 0 interrupted iterations
default   [  66% ] 30/30 VUs  2m57.0s/4m30.0s

running (2m58.0s), 30/30 VUs, 3974 complete and 0 interrupted iterations
default   [  66% ] 30/30 VUs  2m58.0s/4m30.0s

running (2m59.0s), 30/30 VUs, 3991 complete and 0 interrupted iterations
default   [  66% ] 30/30 VUs  2m59.0s/4m30.0s

running (3m00.0s), 30/30 VUs, 4025 complete and 0 interrupted iterations
default   [  67% ] 30/30 VUs  3m00.0s/4m30.0s

running (3m01.0s), 30/30 VUs, 4039 complete and 0 interrupted iterations
default   [  67% ] 30/30 VUs  3m01.0s/4m30.0s

running (3m02.0s), 30/30 VUs, 4058 complete and 0 interrupted iterations
default   [  67% ] 30/30 VUs  3m02.0s/4m30.0s

running (3m03.0s), 30/30 VUs, 4073 complete and 0 interrupted iterations
default   [  68% ] 30/30 VUs  3m03.0s/4m30.0s

running (3m04.0s), 30/30 VUs, 4073 complete and 0 interrupted iterations
default   [  68% ] 30/30 VUs  3m04.0s/4m30.0s

running (3m05.0s), 30/30 VUs, 4104 complete and 0 interrupted iterations
default   [  69% ] 30/30 VUs  3m05.0s/4m30.0s

running (3m06.0s), 30/30 VUs, 4131 complete and 0 interrupted iterations
default   [  69% ] 30/30 VUs  3m06.0s/4m30.0s

running (3m07.0s), 30/30 VUs, 4133 complete and 0 interrupted iterations
default   [  69% ] 30/30 VUs  3m07.0s/4m30.0s

running (3m08.0s), 30/30 VUs, 4153 complete and 0 interrupted iterations
default   [  70% ] 30/30 VUs  3m08.0s/4m30.0s

running (3m09.0s), 30/30 VUs, 4165 complete and 0 interrupted iterations
default   [  70% ] 30/30 VUs  3m09.0s/4m30.0s

running (3m10.0s), 30/30 VUs, 4165 complete and 0 interrupted iterations
default   [  70% ] 30/30 VUs  3m10.0s/4m30.0s

running (3m11.0s), 30/30 VUs, 4173 complete and 0 interrupted iterations
default   [  71% ] 30/30 VUs  3m11.0s/4m30.0s

running (3m12.0s), 30/30 VUs, 4232 complete and 0 interrupted iterations
default   [  71% ] 30/30 VUs  3m12.0s/4m30.0s

running (3m13.0s), 30/30 VUs, 4268 complete and 0 interrupted iterations
default   [  71% ] 30/30 VUs  3m13.0s/4m30.0s

running (3m14.0s), 30/30 VUs, 4268 complete and 0 interrupted iterations
default   [  72% ] 30/30 VUs  3m14.0s/4m30.0s

running (3m15.0s), 30/30 VUs, 4276 complete and 0 interrupted iterations
default   [  72% ] 30/30 VUs  3m15.0s/4m30.0s

running (3m16.0s), 30/30 VUs, 4336 complete and 0 interrupted iterations
default   [  73% ] 30/30 VUs  3m16.0s/4m30.0s

running (3m17.0s), 30/30 VUs, 4381 complete and 0 interrupted iterations
default   [  73% ] 30/30 VUs  3m17.0s/4m30.0s

running (3m18.0s), 30/30 VUs, 4381 complete and 0 interrupted iterations
default   [  73% ] 30/30 VUs  3m18.0s/4m30.0s

running (3m19.0s), 30/30 VUs, 4422 complete and 0 interrupted iterations
default   [  74% ] 30/30 VUs  3m19.0s/4m30.0s

running (3m20.0s), 30/30 VUs, 4426 complete and 0 interrupted iterations
default   [  74% ] 30/30 VUs  3m20.0s/4m30.0s

running (3m21.0s), 30/30 VUs, 4427 complete and 0 interrupted iterations
default   [  74% ] 30/30 VUs  3m21.0s/4m30.0s

running (3m22.0s), 30/30 VUs, 4465 complete and 0 interrupted iterations
default   [  75% ] 30/30 VUs  3m22.0s/4m30.0s

running (3m23.0s), 30/30 VUs, 4491 complete and 0 interrupted iterations
default   [  75% ] 30/30 VUs  3m23.0s/4m30.0s

running (3m24.0s), 30/30 VUs, 4523 complete and 0 interrupted iterations
default   [  76% ] 30/30 VUs  3m24.0s/4m30.0s

running (3m25.0s), 30/30 VUs, 4585 complete and 0 interrupted iterations
default   [  76% ] 30/30 VUs  3m25.0s/4m30.0s

running (3m26.0s), 30/30 VUs, 4625 complete and 0 interrupted iterations
default   [  76% ] 30/30 VUs  3m26.0s/4m30.0s

running (3m27.0s), 30/30 VUs, 4659 complete and 0 interrupted iterations
default   [  77% ] 30/30 VUs  3m27.0s/4m30.0s

running (3m28.0s), 30/30 VUs, 4699 complete and 0 interrupted iterations
default   [  77% ] 30/30 VUs  3m28.0s/4m30.0s

running (3m29.0s), 30/30 VUs, 4699 complete and 0 interrupted iterations
default   [  77% ] 30/30 VUs  3m29.0s/4m30.0s

running (3m30.0s), 30/30 VUs, 4705 complete and 0 interrupted iterations
default   [  78% ] 30/30 VUs  3m30.0s/4m30.0s

running (3m31.0s), 30/30 VUs, 4765 complete and 0 interrupted iterations
default   [  78% ] 30/30 VUs  3m31.0s/4m30.0s

running (3m32.0s), 30/30 VUs, 4826 complete and 0 interrupted iterations
default   [  79% ] 30/30 VUs  3m32.0s/4m30.0s

running (3m33.0s), 30/30 VUs, 4858 complete and 0 interrupted iterations
default   [  79% ] 30/30 VUs  3m33.0s/4m30.0s

running (3m34.0s), 30/30 VUs, 4884 complete and 0 interrupted iterations
default   [  79% ] 30/30 VUs  3m34.0s/4m30.0s

running (3m35.0s), 30/30 VUs, 4917 complete and 0 interrupted iterations
default   [  80% ] 30/30 VUs  3m35.0s/4m30.0s

running (3m36.0s), 30/30 VUs, 4949 complete and 0 interrupted iterations
default   [  80% ] 30/30 VUs  3m36.0s/4m30.0s

running (3m37.0s), 30/30 VUs, 4960 complete and 0 interrupted iterations
default   [  80% ] 30/30 VUs  3m37.0s/4m30.0s

running (3m38.0s), 30/30 VUs, 4960 complete and 0 interrupted iterations
default   [  81% ] 30/30 VUs  3m38.0s/4m30.0s

running (3m39.0s), 30/30 VUs, 4975 complete and 0 interrupted iterations
default   [  81% ] 30/30 VUs  3m39.0s/4m30.0s

running (3m40.0s), 30/30 VUs, 5030 complete and 0 interrupted iterations
default   [  81% ] 30/30 VUs  3m40.0s/4m30.0s

running (3m41.0s), 30/30 VUs, 5038 complete and 0 interrupted iterations
default   [  82% ] 30/30 VUs  3m41.0s/4m30.0s

running (3m42.0s), 30/30 VUs, 5042 complete and 0 interrupted iterations
default   [  82% ] 30/30 VUs  3m42.0s/4m30.0s

running (3m43.0s), 30/30 VUs, 5081 complete and 0 interrupted iterations
default   [  83% ] 30/30 VUs  3m43.0s/4m30.0s

running (3m44.0s), 30/30 VUs, 5129 complete and 0 interrupted iterations
default   [  83% ] 30/30 VUs  3m44.0s/4m30.0s

running (3m45.0s), 30/30 VUs, 5129 complete and 0 interrupted iterations
default   [  83% ] 30/30 VUs  3m45.0s/4m30.0s

running (3m46.0s), 30/30 VUs, 5136 complete and 0 interrupted iterations
default   [  84% ] 30/30 VUs  3m46.0s/4m30.0s

running (3m47.0s), 30/30 VUs, 5163 complete and 0 interrupted iterations
default   [  84% ] 30/30 VUs  3m47.0s/4m30.0s

running (3m48.0s), 30/30 VUs, 5163 complete and 0 interrupted iterations
default   [  84% ] 30/30 VUs  3m48.0s/4m30.0s

running (3m49.0s), 30/30 VUs, 5176 complete and 0 interrupted iterations
default   [  85% ] 30/30 VUs  3m49.0s/4m30.0s

running (3m50.0s), 30/30 VUs, 5219 complete and 0 interrupted iterations
default   [  85% ] 30/30 VUs  3m50.0s/4m30.0s

running (3m51.0s), 30/30 VUs, 5251 complete and 0 interrupted iterations
default   [  86% ] 30/30 VUs  3m51.0s/4m30.0s

running (3m52.0s), 30/30 VUs, 5251 complete and 0 interrupted iterations
default   [  86% ] 30/30 VUs  3m52.0s/4m30.0s

running (3m53.0s), 30/30 VUs, 5256 complete and 0 interrupted iterations
default   [  86% ] 30/30 VUs  3m53.0s/4m30.0s

running (3m54.0s), 30/30 VUs, 5278 complete and 0 interrupted iterations
default   [  87% ] 30/30 VUs  3m54.0s/4m30.0s

running (3m55.0s), 30/30 VUs, 5317 complete and 0 interrupted iterations
default   [  87% ] 30/30 VUs  3m55.0s/4m30.0s

running (3m56.0s), 30/30 VUs, 5333 complete and 0 interrupted iterations
default   [  87% ] 30/30 VUs  3m56.0s/4m30.0s

running (3m57.0s), 30/30 VUs, 5368 complete and 0 interrupted iterations
default   [  88% ] 30/30 VUs  3m57.0s/4m30.0s

running (3m58.0s), 30/30 VUs, 5414 complete and 0 interrupted iterations
default   [  88% ] 30/30 VUs  3m58.0s/4m30.0s

running (3m59.0s), 30/30 VUs, 5475 complete and 0 interrupted iterations
default   [  89% ] 30/30 VUs  3m59.0s/4m30.0s

running (4m00.0s), 30/30 VUs, 5487 complete and 0 interrupted iterations
default   [  89% ] 30/30 VUs  4m00.0s/4m30.0s

running (4m01.0s), 30/30 VUs, 5487 complete and 0 interrupted iterations
default   [  89% ] 30/30 VUs  4m01.0s/4m30.0s

running (4m02.0s), 29/30 VUs, 5502 complete and 0 interrupted iterations
default   [  90% ] 29/30 VUs  4m02.0s/4m30.0s

running (4m03.0s), 29/30 VUs, 5532 complete and 0 interrupted iterations
default   [  90% ] 29/30 VUs  4m03.0s/4m30.0s

running (4m04.0s), 28/30 VUs, 5557 complete and 0 interrupted iterations
default   [  90% ] 28/30 VUs  4m04.0s/4m30.0s

running (4m05.0s), 26/30 VUs, 5600 complete and 0 interrupted iterations
default   [  91% ] 26/30 VUs  4m05.0s/4m30.0s

running (4m06.0s), 25/30 VUs, 5668 complete and 0 interrupted iterations
default   [  91% ] 25/30 VUs  4m06.0s/4m30.0s

running (4m07.0s), 24/30 VUs, 5730 complete and 0 interrupted iterations
default   [  91% ] 24/30 VUs  4m07.0s/4m30.0s

running (4m08.0s), 23/30 VUs, 5769 complete and 0 interrupted iterations
default   [  92% ] 23/30 VUs  4m08.0s/4m30.0s

running (4m09.0s), 23/30 VUs, 5773 complete and 0 interrupted iterations
default   [  92% ] 23/30 VUs  4m09.0s/4m30.0s

running (4m10.0s), 23/30 VUs, 5782 complete and 0 interrupted iterations
default   [  93% ] 23/30 VUs  4m10.0s/4m30.0s

running (4m11.0s), 20/30 VUs, 5826 complete and 0 interrupted iterations
default   [  93% ] 20/30 VUs  4m11.0s/4m30.0s

running (4m12.0s), 20/30 VUs, 5869 complete and 0 interrupted iterations
default   [  93% ] 20/30 VUs  4m12.0s/4m30.0s

running (4m13.0s), 20/30 VUs, 5890 complete and 0 interrupted iterations
default   [  94% ] 20/30 VUs  4m13.0s/4m30.0s

running (4m14.0s), 18/30 VUs, 5912 complete and 0 interrupted iterations
default   [  94% ] 18/30 VUs  4m14.0s/4m30.0s

running (4m15.0s), 17/30 VUs, 5917 complete and 0 interrupted iterations
default   [  94% ] 17/30 VUs  4m15.0s/4m30.0s

running (4m16.0s), 17/30 VUs, 5917 complete and 0 interrupted iterations
default   [  95% ] 17/30 VUs  4m16.0s/4m30.0s

running (4m17.0s), 16/30 VUs, 5921 complete and 0 interrupted iterations
default   [  95% ] 16/30 VUs  4m17.0s/4m30.0s

running (4m18.0s), 16/30 VUs, 5921 complete and 0 interrupted iterations
default   [  96% ] 16/30 VUs  4m18.0s/4m30.0s

running (4m19.0s), 15/30 VUs, 5923 complete and 0 interrupted iterations
default   [  96% ] 15/30 VUs  4m19.0s/4m30.0s

running (4m20.0s), 11/30 VUs, 5969 complete and 0 interrupted iterations
default   [  96% ] 11/30 VUs  4m20.0s/4m30.0s

running (4m21.0s), 10/30 VUs, 6003 complete and 0 interrupted iterations
default   [  97% ] 10/30 VUs  4m21.0s/4m30.0s

running (4m22.0s), 09/30 VUs, 6023 complete and 0 interrupted iterations
default   [  97% ] 09/30 VUs  4m22.0s/4m30.0s

running (4m23.0s), 09/30 VUs, 6025 complete and 0 interrupted iterations
default   [  97% ] 09/30 VUs  4m23.0s/4m30.0s

running (4m24.0s), 08/30 VUs, 6051 complete and 0 interrupted iterations
default   [  98% ] 08/30 VUs  4m24.0s/4m30.0s

running (4m25.0s), 06/30 VUs, 6072 complete and 0 interrupted iterations
default   [  98% ] 06/30 VUs  4m25.0s/4m30.0s

running (4m26.0s), 05/30 VUs, 6090 complete and 0 interrupted iterations
default   [  99% ] 05/30 VUs  4m26.0s/4m30.0s

running (4m27.0s), 04/30 VUs, 6105 complete and 0 interrupted iterations
default   [  99% ] 04/30 VUs  4m27.0s/4m30.0s

running (4m28.0s), 03/30 VUs, 6117 complete and 0 interrupted iterations
default   [  99% ] 03/30 VUs  4m28.0s/4m30.0s

running (4m29.0s), 02/30 VUs, 6127 complete and 0 interrupted iterations
default   [ 100% ] 02/30 VUs  4m29.0s/4m30.0s

running (4m30.0s), 01/30 VUs, 6131 complete and 0 interrupted iterations
default   [ 100% ] 01/30 VUs  4m30.0s/4m30.0s

running (4m31.0s), 01/30 VUs, 6131 complete and 0 interrupted iterations
default ↓ [ 100% ] 01/30 VUs  4m30s

running (4m32.0s), 01/30 VUs, 6131 complete and 0 interrupted iterations
default ↓ [ 100% ] 01/30 VUs  4m30s

     ✗ status 200
      ↳  92% — ✓ 5701 / ✗ 431

     checks.........................: 92.97% ✓ 5701      ✗ 431 
     data_received..................: 1.7 MB 6.4 kB/s
     data_sent......................: 1.1 MB 4.0 kB/s
     http_req_blocked...............: avg=7.36µs   min=1.35µs  med=4.18µs   max=975.42µs p(90)=7µs      p(95)=8.57µs  
     http_req_connecting............: avg=1.71µs   min=0s      med=0s       max=648.83µs p(90)=0s       p(95)=0s      
   ✓ http_req_duration..............: avg=907.13ms min=1.32ms  med=339.08ms max=5.91s    p(90)=2.73s    p(95)=3.09s   
       { expected_response:true }...: avg=911.77ms min=17.9ms  med=342.79ms max=5.91s    p(90)=2.74s    p(95)=3.1s    
   ✓ http_req_failed................: 7.02%  ✓ 431       ✗ 5701
     http_req_receiving.............: avg=111.52µs min=19.12µs med=86.29µs  max=5.27ms   p(90)=126.74µs p(95)=163.49µs
     http_req_sending...............: avg=36.8µs   min=6.81µs  med=33.59µs  max=501.98µs p(90)=61.03µs  p(95)=78.53µs 
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=906.98ms min=1.24ms  med=338.87ms max=5.91s    p(90)=2.73s    p(95)=3.09s   
     http_reqs......................: 6132   22.516882/s
     iteration_duration.............: avg=1.1s     min=56.75ms med=564.1ms  max=6.01s    p(90)=2.93s    p(95)=3.29s   
     iterations.....................: 6132   22.516882/s
     test_errors....................: 431    1.582645/s
     test_latency_ms................: avg=907.28ms min=1ms     med=339ms    max=5.91s    p(90)=2.73s    p(95)=3.09s   
     test_slow_requests.............: 1222   4.487219/s
     vus............................: 1      min=1       max=30
     vus_max........................: 30     min=30      max=30


running (4m32.3s), 00/30 VUs, 6132 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/30 VUs  4m30s